// 5 недопустимых имен переменных

//нельзя начинать с цифры
let 1name

// нельзы использовать символы заисключением нижнего подчеркивания _ и символа доллар $
let my#name

// пробелы недопустимы в именах переменных
let my name

// связка двух слов невозможно через тире используй нижнее подчеркивание 
//или пиши слитно и меняй регистр первой буквы второго слова "Let my_name" "let myName"
let my-name

// писать имя переменной не на латинице считается не правильной практикой
let имяПеременной

// использовать ключевые (зарезервированные) слова в js  в качестве имен переменных - Ошибка!!
let boolean
let const 
