// 5 недопустимых имен переменных

// 1. нельзя начинать с цифры
let 1name

// 2. нельзы использовать символы заисключением нижнего подчеркивания _ и символа доллар $
let my#name

// 3. пробелы недопустимы в именах переменных
let my name

// 4. связка двух слов невозможно через тире используй нижнее подчеркивание 
//или пиши слитно и меняй регистр первой буквы второго слова "Let my_name" "let myName"
let my-name

//5. писать имя переменной не на латинице считается не правильной практикой
let имяПеременной

//6. использовать ключевые (зарезервированные) слова в js  в качестве имен переменных - Ошибка.
let boolean
let const 
